app/views/posts/index.html.erb

            <p class="card-text">Hecho por: <%= post.user.email %></p>
            <p class="card-text"><%= post.likes.count %> Likes</p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 7]]