app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes"
---
  def index
    @likes = Like.all

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["post_id", 11], ["created_at", "2023-07-11 02:17:18.244451"], ["updated_at", "2023-07-11 02:17:18.244451"]]
---
  def create
    @post = Post.find(params[:post_id])
    @like = @post.likes.build(user: current_user)

    if @like.save