app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.create(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["content", "sadsad"], ["created_at", "2023-07-10 23:03:02.933478"], ["updated_at", "2023-07-10 23:03:02.933478"]]
INSERT INTO "posts" ("user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["content", nil], ["created_at", "2023-07-10 21:29:14.646372"], ["updated_at", "2023-07-10 21:29:14.646372"]]